[{"S-NO":2,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":34046817},{"S-NO":4,"Exercise risk evaluation":"Step test","Method":null,"PMID":33576240},{"S-NO":5,"Exercise risk evaluation":"Medical clearance","Method":"Psychological and physical tests","PMID":35007642},{"S-NO":6,"Exercise risk evaluation":"Peak graded exercise test","Method":"For HIIT patients only, a peak graded exercise test (GXT) to exhaustion on a treadmill using an individualized ramp protocol was performed.","PMID":34245777},{"S-NO":12,"Exercise risk evaluation":"Medical clearance","Method":"Physical examination","PMID":34245349},{"S-NO":12,"Exercise risk evaluation":"Medical clearance","Method":"A baseline survey at Time point 1 (T1) with a detailed psychiatric anamnesis, questionnaires and physical examination was carried out before the start of the intervention to determine the current psychopathology with symptom severity and to exclude psychological and physical contraindications. ","PMID":34245349},{"S-NO":15,"Exercise risk evaluation":"Submaximal aerobic capacity test","Method":"A submaximal aerobic capacity test was conducted on an indoor bicycle, estimating a VO2 max. In this study, aerobic capacity was presented as relative to bodyweight (the total amount of oxygen metabolized per min ute per kilogram of body weight, mL\/kg\/minutes). The patient cycled for 6minutes with a pedal frequency of 50rpm. When a steady state was reached at a heart rate (HR)>130 beats per minute the aerobic capacity could be determined. The aerobic capacity was calculated by the Åstrand nomogram that takes gender, age, resistance, and HR at steady state into consideration. For adolescents aged 15 to 25years, we applied an additional age correction factor of 1.10.","PMID":33858215},{"S-NO":17,"Exercise risk evaluation":"Graded exercise test","Method":null,"PMID":34255075},{"S-NO":19,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":34218001},{"S-NO":21,"Exercise risk evaluation":"Graded exercise test","Method":"The VO2peak and HRpeak were measured using a walking treadmill-based graded exercise test until volitional  exhaustion. ","PMID":33714191},{"S-NO":22,"Exercise risk evaluation":"Muscle strength test","Method":"Before the formal test, all subjects continued to undergo routine early rehabilitation and stroke medications.First, each subject underwent a maximum muscle strength test, followed by 3 randomised resistance exercise tests (1. Low-intensity resistance exercise (LOW group); 2. Blood flow restriction low-intensity resistance exercise (L-BFR group); 3. High-intensity resistance exercise (HIGH)). There were 3 days between each test, and the test duration was between 14:00 and 17:00. Cubital venous blood was collected before and immediately after exercise, to test for blood biochemical indicators. The subjects were asked about RPE before and after exercise (using the Borg 6-20 scale to assess the subject’s subjective physical sensation before and after exercise) and were required to wear a blood oxygen saturation finger clip throughout the process for safety purposes.","PMID":34436843},{"S-NO":23,"Exercise risk evaluation":"Medical clearance","Method":"All patients underwent physical examination. An electrocardiogram (ECG) was obtained. Furthermore, bodyweight and height to calculate BMI, resting HR and blood pressure (BP) were measured. ","PMID":33805073},{"S-NO":24,"Exercise risk evaluation":"PAR-Q;CVD risk factors evaluation","Method":null,"PMID":34733186},{"S-NO":27,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":34706414},{"S-NO":33,"Exercise risk evaluation":"Submaximal graded exercise test","Method":null,"PMID":34501476},{"S-NO":36,"Exercise risk evaluation":"Hemodynamic assessment","Method":"Each session of intradialytic exercise started at 30 min after the beginning of hemodialysis when the hemodynamic stability of patients was confirmed (without complaint of chest pain, dyspnea, pallor, diaphoresis, or dizziness; had systolic pressure >200 mmHg or diastolic pressure >120 mmHg; had a decrease in systolic pressure of >10 mmHg compared to the systolic pressure at rest, or requested stopping the exercise). ","PMID":34501792},{"S-NO":37,"Exercise risk evaluation":"PAR-Q;Medical clearance","Method":"All these criteria were evaluated by a physician using the Physical Activity Readiness-Questionnaire (PAR-Q) and the medical health\/history questionnaire.","PMID":33556410},{"S-NO":44,"Exercise risk evaluation":"Lovett test","Method":"Before starting the rehabilitation training (kinesis), each patient was tested with the Lovett test. The Lovett test is currently the most common method of subjective muscle strength assessment. It involves the palpation of individual muscles in certain body positions and movement. In every movement, there is one main muscle that is responsible for movement. Due to the appropriate position, it is isolated from other synergistic muscles. According to Lovett, the following levels of muscle strength are distinguished: 0, no active muscle contraction; 1, a trace of active muscle contraction; 2, a clear muscle contraction and the ability to move and relieve mobility in a section; 3, the ability to move independently active with overcoming the weight of a given section; 4, the ability to perform active movement with some resistance; 5, correct force, i.e., the ability to perform active movement with full resistance. This scale can be expressed as a percentage, then: 0 = 0%, 1 = 10%, 2 = 25%, 3 = 50%, 4 = 75%, 5 = 100%. For a more accurate assessment of muscle strength, the intermediate steps 2+, 3 are used when strength is rated above 1° and below the next step. Depending on the results obtained on the Lovett scale, patients were subjected to local or general kinesiotherapy. Local kinesiotherapy does not involve the whole organism, it affects the area of dysfunction, usually it does not change the circulatory and respiratory parameters, it can be used in people for whom exercise is contraindicated.","PMID":34360348},{"S-NO":45,"Exercise risk evaluation":"PAR-Q+;ePARmed-X+","Method":null,"PMID":34580067},{"S-NO":49,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"CPX(Cardiopulmonary Exercise Testing) was conducted with an upright electromechanical ergometric bicycle using a ramp protocol (15–25 watts\/min) to evaluate VT(ventilatory threshold) and VO2max. During CPX, respiratory gas analysis was simultaneously performed with a breath-by-breath apparatus. Finally, the VT was determined by the V-slope method. Specifically, VT was defined as the non-linear point of increase in the slope of CO2 production versus oxygen uptake during the incremental exercise.","PMID":34880736},{"S-NO":56,"Exercise risk evaluation":"Medical clearance","Method":"Physical examination","PMID":33401978},{"S-NO":62,"Exercise risk evaluation":"PAR-Q;CVD risk factors evaluation","Method":"Screening recommendations from the Canadian Society for Exercise Physiology and the American College of Sports Medicine included the 7-item Physical Activity Readiness Questionnaire (PAR-Q) and questions assessing cardiovascular disease risk. All questions were answered in a yes\/no format. Individuals at “moderate” (≥2 ‘yes’ answers on the PAR-Q) or “high”(diagnosis of a cardiovascular, metabolic, or pulmonary disease) risk required medical clearance from their family physician and approval from the 4th author (a PhD kinesiologist with expertise in cardiovascular function during exercise).  ","PMID":33242717},{"S-NO":64,"Exercise risk evaluation":"Physical examination;Aerobic capacity assessment","Method":null,"PMID":34204400},{"S-NO":65,"Exercise risk evaluation":"Physical examination;Aerobic capacity assessment","Method":null,"PMID":34536433},{"S-NO":69,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":32838817},{"S-NO":70,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":32711017},{"S-NO":71,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"VO2max (the maximal capacity of oxygen consumption and transportation) is used to reflect  the cardiopulmonary fitness. Submaximal graded bike test  with increment of resistance in every one minute was used to estimate VO2max with the help of gas analyzer. The changes in heart rate and exhaled gas  components were monitored in every 15 seconds by the gas analyzer system and VO2max was estimated based on the trend of  change in oxygen consumption with respect to the change in  heart rate.","PMID":32772583},{"S-NO":73,"Exercise risk evaluation":"Medical clearance","Method":"Patient's psychological state should be understood, and negative mood was eliminated to avoid all kinds of incentives. The following items were observed: heart rate and pain location. After the pain of CHD patients was stable, appropriate physical exercise could be performed safely.","PMID":32831874},{"S-NO":77,"Exercise risk evaluation":"Medical clearance","Method":"At baseline, participants completed a questionnaire comprised of the Exercise and Sports Science Screening Tool (to determine safety to exercise or need to obtain medical clearance).","PMID":33275382},{"S-NO":78,"Exercise risk evaluation":"Medical clearance","Method":"A general medical examination including ECG, case history, and physical examination.","PMID":32625123},{"S-NO":78,"Exercise risk evaluation":"Incremental exercise test","Method":"To test exercise capacity (measured as peak power output in watt), participants performed an incremental exercise test on a bicycle ergometer. The test started with a work load of 50 watts (W) for males and 20 W for females and was increased in 10 W steps each minute until the subjects could not maintain the requested 60 rpm pedal frequency (voluntary exhaustion) or the test was prematurely stopped by the physician due to predefined stopping criteria.","PMID":32625123},{"S-NO":81,"Exercise risk evaluation":"Medical clearance","Method":"All patients underwent physical examination including an electrocardiogram (ECG), blood pressure (BP), resting HR as well as bodyweight and height to calculate BMI.","PMID":32739704},{"S-NO":86,"Exercise risk evaluation":"Medical clearance","Method":"All eligible men were required to obtain a medical clearance from their local physician to ensure that they were free of any contraindicated medical conditions to exercise based on the American College of Sports Medicine guidelines.","PMID":30993400},{"S-NO":87,"Exercise risk evaluation":"Incremental exercise test","Method":"Electrocardiographic tracing and the calculation of values that VO2 max provided were recorded and analyzed using the digital program TEB(Technology Electronica Brasileira®) and treadmill TEB 200\/APEX 1.000 through the Ramp protocol, respectively. The protocol procedures required 3 min of warm-up with an initial speed of 2.5 km\/h and  0% incline, followed by 3 min of gradual and light increments of   speed and\/or incline until 60% of VO2 max or 70% of maximum heart rate (HRmax).  The criteria of the American Heart Association were used to determine when to stop the test.","PMID":31658460},{"S-NO":91,"Exercise risk evaluation":"Cardiopulmonary stress test","Method":"Per the 2010 Heart Failure Society of America (HFSA) guideline recommendation, all participants receive a cardiopulmonary stress test prior to exercise. Once participants have consented to participate in the study, trained staff at the respective sites conduct the cardiopulmonary stress test (CPX). The 2010 HFSA guidelines recommend moderate intensity exercise training in a supervised setting therefore both groups receive 9 exercise training sessions during a 3 week run-in period and continue to exercise after randomization in the supervised setting of a health care exercise facility. Nine exercise training sessions prior to randomization provides training in moderate-intensity aerobic exercise (40%-80% Heart Rate Reserve; HRR) and provides the supervision we feel is necessary to assure the safety of all participants for exercise. If a participant is deemed unsafe\/unable to exercise at the completion of the run-in period, he or she is not randomized to participate in the study. In addition to assuring safety, the decision to only randomize individuals who attend at least 6 of the 9 sessions (minimum of 2 sessions for each of the 3 weeks of run-in) was made to provide an adequate intent-to-treat analysis when examining adherence. We recognize this may limit generalizability, but we feel it is an important first step to ensure safety when investigating adherence to exercise in individuals who have an initial desire to exercise and an informed understanding of exercise expectations.","PMID":31373222},{"S-NO":96,"Exercise risk evaluation":"PAR-Q;Medical clearance","Method":"Regarding testing safety, all participants were screened at baseline using the Physical Activities  Readiness Questionnaire (PAR-Q), and their resting blood pressure was checked to exclude those with cardiac illness or uncontrolled hypertension. Those who answered ‘yes’ to any question on the PAR-Q or whose blood pressure exceeded 160\/100 mmHg were recommended to visit their general sician had checked them.","PMID":31898112},{"S-NO":104,"Exercise risk evaluation":"Spiroergometric study","Method":"Before the start of PA, we assessed exercise risks in each patient, to develop an individualized PA training program for each participant. We conducted a spiroergometric study to assess participants’ cardiopulmonary function. We recorded exercise indicators such as maximum heart rate (HRmax), maximum systolic blood pressure, maximum diastolic blood pressure (dBPmax), physical activity time (PAT), maximum pulmonary ventilation (PVEmax), peak aerobic capacity (VO2peak), and metabolic equivalents (METs). PA training was stopped if the patient reached their target heart rate or experienced any of the following: arrhythmia, hypotension, hypertension, difficulty breathing, dizziness, or ST segment shift >2.0 mm on electrocardiography. Patients who experienced acute myocardial infarction or severe acute heart failure (New York Heart Association class 4) during training would be withdrawn from the study. ","PMID":31948307},{"S-NO":107,"Exercise risk evaluation":"Medical clearance","Method":null,"PMID":31027110},{"S-NO":111,"Exercise risk evaluation":"Cardiopulmonary test","Method":"The cardiopulmonary test was applied by a medical specialist and accompanied by an exercise professional. We used the Balke and Ware cycle ergometer protocol, with 2-minute stages, increasing 25W every stage. The protocol started without any load.  The measurement of blood pressure, heart rate, and  Borg scale was always measured at the end of each stage.","PMID":28810362},{"S-NO":113,"Exercise risk evaluation":"Endurance test","Method":"Before the first training session (t0), prior to the intervention, EG-participants’ fitness level (resting, during exercise, and recovery heart rates) was assessed in a 15-min endurance test on a stationary bicycle (ergo fit cardio line 3000) once.","PMID":29951850},{"S-NO":119,"Exercise risk evaluation":"Incremental exercise test","Method":"Cardiorespiratory fitness (maximal oxygen uptake) was measured with an established test protocol on a bicycle ergometer. During a ramp-protocol, beginning at 25 W, regular increases of intensity of 10 W\/min were applied until subjective perceived exhaustion was reached.","PMID":30903972},{"S-NO":120,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":30797651},{"S-NO":120,"Exercise risk evaluation":"Submaximal graded test(modified Balke protocol)","Method":"A submaximal VO2 test assessed cardiorespiratory fitness(CRF). Participants underwent testing with a modified Balke protocol (i.e., speed remained constant with 2% grade increments every two minutes). The test was terminated when subject’s heart rate reached 85% of the age-based maximum (220-age), volitional fatigue, or RPE >=15.","PMID":30797651},{"S-NO":126,"Exercise risk evaluation":"PAR-Q+;PARmed-X+","Method":null,"PMID":29372589},{"S-NO":127,"Exercise risk evaluation":"Physical fitness capacity","Method":null,"PMID":31427860},{"S-NO":129,"Exercise risk evaluation":"PAR-Q","Method":"PAR-Q","PMID":30453010},{"S-NO":131,"Exercise risk evaluation":"Physical examination","Method":"They were subjected to routine blood tests in the form of blood glucose levels, cholesterol levels, uric acid levels and vital sign examinations to determine the overall health status of the subjects before the exercise. ","PMID":31456825},{"S-NO":138,"Exercise risk evaluation":"Submaximal cardiorespiratory test","Method":"The fitness assessment comprised: a 6–12 minute submaximal cardiorespiratory test on  a cycle ergometer based on the Astrand Ryhming Protocol; evaluation of trunk flexibility measured with a standard sit-and-reach box, utilizing the ACSM (American College of Sports Medicine, 2014) protocol; resting heart rate  taken for a 30 second period via the radial pulse and multiplied by two to provide the minute value; blood pressure taken manually using a Tyocs sphygmomanometer.  ","PMID":30047802},{"S-NO":134,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":30973483},{"S-NO":138,"Exercise risk evaluation":"Medical clearance","Method":"Eligible patients were sent a medical information form to complete and return. After  receiving the patient’s release of medical information, an investigator sent a letter to the  patient’s identified physician requesting his\/her physician’s opinion of the patient’s ability  to participate in exercise. Physicians also received copies of the patient’s release of  information, a copy of the health screen for exercise, and a pre-addressed return envelope. After receiving clearance from the physician,  the potential participant was scheduled for a baseline session. ","PMID":30047802},{"S-NO":149,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":29722574},{"S-NO":152,"Exercise risk evaluation":"PAR-Q;Graded exercise test","Method":null,"PMID":31572241},{"S-NO":153,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":29625012},{"S-NO":154,"Exercise risk evaluation":"Medical clearance","Method":"All patients received  neurologist clearance ensuring they were clinically stable  at entry to the study. Study participants were  screened through a safe participation questionnaire to ensure  they were eligible to undertake the study","PMID":29280019},{"S-NO":161,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"Cardiorespiratory fitness was measured with a bicycle ergometer to establish maximal heart rate (HRmax) and maximal oxygen uptake (VO2max). To this end, a ramp-protocol was used with regular increases of intensity of 10 W\/min until subjective perceived exhaustion (10 on Borg Perceived Exertion Scale), beginning on a level of 25 W. Pedaling cadence was kept constant intra-individually (60–80 revolutions per minute), taking into account subjective pedaling comfort. After having reached exhaustion, participants continued bicycling for 3 min (10 W, 30 revolutions per minute). Resting heart rate was assessed 5 min prior to the start of the bicycle protocol. Breath-by-breath spirometric gas-exchange data were recorded every 10 s via a facemask. VO2max was defined as the highest oxygen uptake averaged over a period of 30 s.","PMID":30622487},{"S-NO":162,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":29559928},{"S-NO":164,"Exercise risk evaluation":"Treadmill walking test","Method":"All patients performed a treadmill walking test until exhaustion to determine peak oxygen uptake (VO2 peak) and lactate threshold. Slope and velocity were increased stepwise after 3 minutes of walking at a time. Lactate samples were drawn after every step to determine lactate threshold using the baseline +1.5 mmol model. Maximum output in Watt was determined using the formula: 9.81 × weight (kg) × velocity (m\/s) × sin α.","PMID":30314962},{"S-NO":165,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"All subjects completed two exhausting exercise tests on a sitting bicycle ergometer before and after the intervention to determine maximal heart rate(HRmax) and maximal oxygen uptake (VO2max). The patients underwent a ramp-protocol with a regular increase of intensity of 10 watts per minute, starting at 25 watts. During exercise testing, breath-by-breath spirometric gas-exchange data, heart rate and ratings of perceived exertion (RPE) (Borg Scale) were collected.","PMID":30048648},{"S-NO":167,"Exercise risk evaluation":"Medical clearance","Method":"One hundred and sixteen persons provided written informed consent and attended a doctor’s examination to assess their health and ability to perform RT","PMID":29124498},{"S-NO":175,"Exercise risk evaluation":"Graded  treadmill exercise test","Method":"Cardiorespiratory fitness was measured by estimating VO2peak from a graded  treadmill exercise test. Participants were encouraged to continue the  treadmill test until volitional fatigue, at which point estimated VO2peak was calculated.","PMID":29270829},{"S-NO":176,"Exercise risk evaluation":"Incremental exercise test","Method":"All subjects completed two exhausting incremental exercise tests on a sitting bicycle ergometer before and after the intervention. Before participants started at a 25 W workload, resting heart rates (pre exercise heart rates) were measured 5 minutes prior to the start of cycling sitting on the ergometer using a Polar heartrate monitor. Every minute an increase of 10 W was applied until subjective perceived exhaustion (Borg 10) was reported. ","PMID":29775886},{"S-NO":179,"Exercise risk evaluation":"Medical clearance","Method":null,"PMID":28488825},{"S-NO":182,"Exercise risk evaluation":"Maximal exercise test","Method":"All participants completed a maximal exercise test on a digital cycle ergometer, using a metabolic cart. Maximum wattage from the pre-intervention test were used to determine the appropriate training intensity for each individual in the exercise groups. ","PMID":29408464},{"S-NO":183,"Exercise risk evaluation":"Submaximal cycle ergometry test","Method":"Cardiorespiratory fitness(CRF) was assessed as V̇O2max (L\/min) and predicted from the Åstrand–Rhyming submaximal cycle ergometry test. The Åstrand–Rhyming test consisted of a 6 min exercise bout on a mechanically breaked cycle ergometer. The participant cycled at a pedalling frequency of 50 rpm and rate of work was set to elicit a heart rate between 120 and 150 beats per minute. Prior to testing, participants were asked to refrain from caffeine, nicotine, alcohol, heavy meals and intense exercise for a specified period of time.  Heart rate during exercise was measured using telemetry. V̇O2max (L\/min) values were adjusted for age according to the Åstrand testing protocol. ","PMID":30140446},{"S-NO":189,"Exercise risk evaluation":"Graded exercise tolerance test","Method":"All participants completed a graded exercise tolerance test and were approved for participation by the study cardiologist. ","PMID":28982298},{"S-NO":193,"Exercise risk evaluation":"Medical clearance;Cycle ergometer test","Method":"Participants were medically cleared by the study physician to engage in a program of moderate-intensity exercise and engaged in a cycle fitness test. Cardiorespiratory fitness was assessed with the 6-minute Astrand-Ryhming fitness cycle ergometer testing protocol. After a brief warm-up period (~2–3 minutes), the exercise physiologist adjusted the power output on the ergometer to emit a heart rate of 125–170 bpm. Participants cycled at a fixed pace of 50 revolutions\/min. Heart rate and blood pressure were monitored during the test. Gender, weight, steady-state heart rate, workload, and an age-correction factor were used to estimate participants’ VO2max.","PMID":28755778},{"S-NO":199,"Exercise risk evaluation":"PAR-Q","Method":"Both groups were also safety screened for MRI and screened with the Physical Activity Readiness Questionnaire (PAR-Q) to ensure they had no medical contraindications to exercise.","PMID":28828187},{"S-NO":200,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"Exercise tests were conducted on a bicycle ergometer to determine maximal heart rate (HRmax) and maximal oxygen uptake (VO2max). The patients underwent a ramp-protocol with a regular increase of intensity of 10 W\/min, starting at 25 W. During exercise testing, breath-by-breath spirometric gas-exchange data, heart rate (HR), and ratings of perceived exertion were collected.","PMID":29403399},{"S-NO":204,"Exercise risk evaluation":"Symptom-limited exercise stress test","Method":"All patients underwent a symptom-limited exercise stress test(EST) performed on a cycloergometer with the workload increased every 3 minutes by 50 Watts using a computerised system Case 8000. A 3-lead ECG was monitored continuously before, during and for 10 minutes after the test. The test was discontinued in the case of fatigue, arterial blood pressure (BP) increase over 230\/120 mmHg, ST segment depression by at least 2 mm and\/or anginal pain. The test was considered positive when ST segment depression of at least 1 mm was horizontal or down-sloping, 80 ms beyond the J point. The following parameters were analysed: maximal workload  (W), duration (minutes), double product (DP, mmHg\/min), heart rate (HR, bpm) at rest and at peak effort and HR recovery in the first (HRR1) and second minute (HRR2) of the recovery period, which is thought to reflect the reactivation of the parasympathetic nervous system after effort. ","PMID":27899438},{"S-NO":209,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":28402866},{"S-NO":210,"Exercise risk evaluation":"Symptom limited incremental treadmill test","Method":"At baseline and Week 12, all participants underwent a symptom limited incremental treadmill test using the Bruce protocol. Participants were encouraged to continue the exercise protocol to maximal exertion, confirmed by a Rating of Perceived Exertion of at least 17 on the Borg (6–20) scale or a respiratory exchange ratio of at least 1.10. Oxygen consumed (VO2), carbon dioxide produced (VCO2), and minute ventilation (VE) were measured by mouth piece and pneumotachograph throughout exercise.","PMID":27613946},{"S-NO":215,"Exercise risk evaluation":"Medical clearance","Method":"Medical clearance for exercise was obtained from primary clinicians. ","PMID":28579759},{"S-NO":216,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":28644740},{"S-NO":219,"Exercise risk evaluation":"Maximal exercise test","Method":"All participants received a maximal exercise test to determine cardiorespiratory fitness (maximal oxygen consumption, or VO2 max, calculated as liters of oxygen per minute), to screen for abnormal blood pressure and electrocardiogram responses, and to aid in the generation of exercise prescriptions.","PMID":27936452},{"S-NO":222,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"A cardiopulmonary exercise test (CPET) was performed to establish the ventilatory threshold (VT). The heart rate (HR) of the VT was used as the target during the walking sections. Before the CPET, the participants were provided with a standardized set of instructions explaining the tests. On completion of these preliminary procedures, each participant performed a treadmill test to identify the VT. During the CPET, the participants were verbally encouraged to exercise for as long as possible. Respiratory gas samples were analyzed breath-to-breath using a gas analyzer. The HR was recorded using an HR monitor. The VT is a method of assessing aerobic fitness and was determined independently by two experienced investigators.","PMID":29236887},{"S-NO":225,"Exercise risk evaluation":"Maximal oxygen consumption test","Method":"Cardiorespiratory fitness (VO2 peak) was assessed by a maximal oxygen consumption test using a motor-driven treadmill and a modified Bruce protocol. During this test, participants began walking on a treadmill, which increased in speed and incline every 2 min until volitional exhaustion or VO2 peak criteria were met. A Polar HR monitor was used to measure HR throughout the test, and a rating of perceived exertion was taken 1 min into each stage. Rating of perceived exertion allows participants to rate their perceived physical effort on a numerical scale ranging from 6 to 20, which correlates with HR during exercise Relative VO2 peak (ml kg−1 min−1) was determined from direct expired gas exchange data from an indirect calorimetry metabolic system and was established as the maximal average oxygen consumption when at least three of the following criteria were met: (1) a plateau in VO2 values despite a progressive increase in workload, (2) a maximal HR within 10 beats per minute (b.p.m.) of age-predicted maximal values (220 b.p.m. minus age in years), (3) a respiratory exchange ratio greater than 1.10 or (4) a rating of perceived exertion greater than or equal to 17. Oxygen consumption was measured through indirect calorimetry using a ParvoMedics True Max 2400 Metabolic Measurement Cart and was averaged over 15-s intervals. A 3–5 min cool-down was then performed at 2.5 m.p.h. and 0% grade to ensure participants returned to near baseline cardiovascular values. HR was recorded during the fitness assessment and was used to define individual training zones during the intervention.","PMID":26836414},{"S-NO":235,"Exercise risk evaluation":"Medical clearance","Method":"To participate in the study, patients were qualified by a nephrologist and cardiologist. The nephrologist's permission to participate in the study was based on the patient's present condition and biochemical results. ","PMID":26872253},{"S-NO":236,"Exercise risk evaluation":"Medical examination","Method":null,"PMID":26955293},{"S-NO":238,"Exercise risk evaluation":"Medical clearance","Method":"Participants had not engaged in regular physical activity over the past month and were medically cleared to exercise, based on physical examination, fasting blood draw, and a maximal exercise test.","PMID":27164293},{"S-NO":241,"Exercise risk evaluation":"Maximal ergospirometry-stress test","Method":null,"PMID":26667151},{"S-NO":242,"Exercise risk evaluation":"Medical examination;Incremental exercise test","Method":"Medical examination was performed according to the recommendations of the European Heart Association and gave no evidence for previous coronary artery disease, previous myocardial  infarction and angioplasty in the group of depressed patients. None of the patients used ß-blockers or received other cardiologic treatments.","PMID":26707353},{"S-NO":243,"Exercise risk evaluation":"Incremental exercise test","Method":"For testing maximum oxygen uptake (VO2peak), participants performed an incremental exercise test under the supervision of a physician using a spirometric system on a speed‐independent bicycle ergometer. ECG (Electrocardiogram)‐monitoring was performed with the subject in a sitting position. The incremental test started with a load of 20 W at a constant cadence of 60–70 revolutions per minute, and the load increased 10 W every minute until the onset of subjective overexertion (peripheral muscle fatigue or dyspnea). The subjective perceived exertion was assessed by the Borg scale, ranging from extremely light to extremely hard.","PMID":27134769},{"S-NO":245,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":27387295},{"S-NO":247,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":27697714},{"S-NO":254,"Exercise risk evaluation":"Medical clearance","Method":"Before electroconvulsive therapy treatment, a medical history and physical examination, lab history, as well as electrocardiogram (ECG) was performed.","PMID":26859236},{"S-NO":257,"Exercise risk evaluation":"Maximal treadmill exercise stress test","Method":null,"PMID":26956652},{"S-NO":259,"Exercise risk evaluation":"Graded treadmill exercise test","Method":"Graded treadmill exercise testing was conducted before and after the 4-month treatment program to: a) establish an initial exercise prescription for participants randomized to exercise, and; b) to document changes in patients’ aerobic fitness. Patients exercised to exhaustion under continuous electrocardiographic monitoring in which workloads were increased at a rate of 1 metabolic equivalent\/min. Expired gases were analyzed by a Parvo Medics True One measurement system. Peak VO2 served as the primary measure of aerobic fitness.","PMID":26867076},{"S-NO":260,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":null,"PMID":27152523},{"S-NO":264,"Exercise risk evaluation":"Medical clearance","Method":"Women signed a release form allowing us to contact their prenatal care clinician to request medical clearance for participation. ","PMID":26385456},{"S-NO":265,"Exercise risk evaluation":"PAR-Q","Method":"All patients were screened with the Physical Activity Readiness Questionnaire (PAR-Q). Any patient who scored 1 (yes) or more were questioned further and their family physician was contacted, the details of the programme and the PA expectations of participants were explained to the family physician, and we requested a written note from the physician that their patient's concomitant medical condition was not an exclusion to participating in our programme. Researchers prepared a list of appropriate, available and affordable resources and counselling services, which they handed to every participant at the start of the intervention.","PMID":27900130},{"S-NO":266,"Exercise risk evaluation":"PARmed-X","Method":null,"PMID":25407380},{"S-NO":267,"Exercise risk evaluation":"Medical clearance","Method":null,"PMID":25747520},{"S-NO":268,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"The second visit was then programmed with the study cardiologist to assess aerobic capacity under electrocardiographic monitoring. Rest and peak maximum oxygen uptake (VO2max) was tested on a cycle ergometer with breath-by-breath expired gas analysis. The test had a duration of 12 min: it began with a 3 min warm-up and was carried out with workload increments of 10 W\/min for women and 15 W\/min for men. The test was interrupted earlier than 12 min in the following conditions: muscular exhaustion, refusal of the patient to continue, respiratory quotient ≥1.03, reaching the plateau of oxygen consumption. The test was suspended and the participant excluded on appearance of signs of atrial fibrillation or other arrhythmias.","PMID":26206864},{"S-NO":271,"Exercise risk evaluation":"Medical clearance","Method":"All participants had their health status assessed by a physician, and the ones considered healthy to participate were included in the study. Also they had their health condition monitored during exercise by the physical therapist and physical education teacher. Vital signs and blood pressure were also verified in order to guarantee the participants safety. ","PMID":25760119},{"S-NO":284,"Exercise risk evaluation":"Medical examination ","Method":"Medical examination was performed according to the recommendations of the  European Heart Association and gave no evidence for previous coronary artery disease, previous myocardial infarction and angioplasty in the group of depressed patients. None of the patients used ß-blockers or received other cardiologic treatments. ","PMID":25743367},{"S-NO":287,"Exercise risk evaluation":"Medical clearance","Method":"Before the start of each exercise session, we placed a blood pressure cuff and heart rate and SpO2  monitors on participants and left them on throughout the session.  Hemodialysis (HD) physicians also assessed the participant's clinical condition at this time (i.e., shortness of breath, cardiovascular  symptoms, blood pressure, and heart rate). Once the session began, the research assistant measured the participant’s blood  pressure, heart rate and SpO2 electronically every 5–10 min for safety.  Participants were excluded  from the exercise session if their systolic blood pressure was  higher than 180 mmHg, diastolic blood pressure was higher  than 95 mmHg, heartbeat was below 60 beats\/min, or SpO2 was  less than 88%. ","PMID":25027035},{"S-NO":292,"Exercise risk evaluation":"Electrocardiogram","Method":"Patients allocated to physical exercise underwent an electrocardiogram (ECG) and, if indicated, an ergometric test.","PMID":26174334},{"S-NO":293,"Exercise risk evaluation":"Medical clearance","Method":"Prior to participating in each physical training session and before the physiological tests, a clinical nurse specialist (JL) screened each patient. If one of the following criteria were met, the patient was prohibited from exercising\/being tested on that day: diastolic blood pressure <45 or >95; heart rate (HR) at rest >115\/min; temperature >38°C; respiratory rate at rest >30\/min; infection requiring treatment; fresh bleeding; and total leukocyte count <1.0 × 109\/L or platelets <50 × 109\/L. ","PMID":25800229},{"S-NO":297,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":25439084},{"S-NO":298,"Exercise risk evaluation":"Medical clearance","Method":"To ensure there were no contraindications for participation in an exercise program, an extensive medical history was obtained and a full medical examination, resting ECG and blood pressure measurement were performed. ","PMID":27357556},{"S-NO":298,"Exercise risk evaluation":"Graded exercise test","Method":"Patients assigned to the aerobic exercise group underwent graded exercise testing (GET) on a treadmill, using the Bruce protocol to screen for abnormal blood pressure and ECG responses, assess physical fitness and prescribe the intensity of the exercise program.","PMID":27357556},{"S-NO":299,"Exercise risk evaluation":"Electrocardiogram","Method":"Patients allocated to physical exercise underwent ECG and, if indicated, an ergometric test before the study.","PMID":26347775},{"S-NO":301,"Exercise risk evaluation":"Cardiovascular disease screening","Method":null,"PMID":26075212},{"S-NO":311,"Exercise risk evaluation":"Revised PAR-Q","Method":null,"PMID":25043321},{"S-NO":314,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":24800081},{"S-NO":316,"Exercise risk evaluation":"PAR-Q","Method":"All participants were healthy enough for PA according to the Physical Activity Readiness Questionnaire (PARQ). Each participant provided a signed physician’s release form  indicating that she was healthy enough to participate. ","PMID":22738284},{"S-NO":318,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"To estimate the cardiovascular fitness of  the participants a bicycle cardiopulmonary exercise test was used based on Andersen's  cycle exercise protocol.","PMID":24882173},{"S-NO":322,"Exercise risk evaluation":"Medical clearance","Method":"All participants underwent a complete physical  examination, an exercise electrocardiogram (ECG) and  routine blood investigation. We also ensured  that the fitness level of the participants was appropriate (based on medical criteria, e.g., heart frequency, pulse,  blood pressure) to participate in sports. ","PMID":24487666},{"S-NO":323,"Exercise risk evaluation":"Standard step test","Method":"Cardiorespiratory capacity was assessed using a  standard step test designed for older adults, in which heart rate  is recorded electronically. Maximum aerobic power was calculated based on the linear relationship between heart rate and  work rate and assuming a maximum heart rate of 220 minus age. ","PMID":23833045},{"S-NO":326,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"Participants performed a Bruce protocol to determine their peak oxygen uptake (VO2peak).  Each stage of the Bruce protocol lasted for 3 minutes.  The initial speed was 1.7 miles per hour (mph), and the inclination was 10%. A 0.7–0.8-mph increase in speed and a 2% increase in the inclination were  administered for each consecutive stage.  The test was halted when the participant indicated exhaustion by means of a hand signal.  The expired gas  was analyzed using a metabolic cart breath by breath. The maximal VO2 value (milligram per  kilogram per minute) obtained close to exhaustion was considered to be  the VO2peak.  The assessment was considered valid when one of the following criteria was met: estimated maximal heart rate was reached (220-age),  a respiratory exchange ratio greater than 1.15 was reached and a maximum  respiratory rate of at least 35 breaths per minute was reached.","PMID":24329155},{"S-NO":327,"Exercise risk evaluation":"PAR-Q","Method":"Patients were excluded if they had three or more cardiovascular risk factors  according to the Physical Activity Readiness Questionnaire (PAR-Q).","PMID":24487616},{"S-NO":333,"Exercise risk evaluation":"Medical clearance","Method":"The women were medically  cleared for participation in the study by their obstetrician\/gynecologist at the prenatal ultrasound clinics.","PMID":24138994},{"S-NO":335,"Exercise risk evaluation":"Suicide risk ","Method":"A medical doctor (MGR) with 2 years of psychiatry training made the clinical diagnosis as well as the rating on suicide item on HRSD. ","PMID":24049201},{"S-NO":337,"Exercise risk evaluation":"Medical clearance","Method":"They had to provide a letter from a family physician approving that it was safe to participate in an exercise study.","PMID":24244220},{"S-NO":347,"Exercise risk evaluation":"Metabolic exercise test","Method":"All patients underwent metabolic exercise testing on a cycle ergometer using a 10W\/min stepped protocol. Electrocardiography was continuously monitored for ST-segment changes and arrhythmias; blood pressure and 12-lead electrocardiography were recorded before exercise, every 2 minutes during the test, and during the recovery period after exercise. Tests were symptom limited, with the usual endpoints being dyspnea and leg fatigue, and some participants were limited by arrhythmia and decreased or exaggerated blood pressure response. Measured peak VO2 was obtained by breath-by-breath analyses of expired gas, averaged over 20-second intervals. Every 3 sequential measurements were averaged and peak VO2 was defined as the greatest mean value during exercise. Anerobic threshold (AT) was calculated using the V-slope method.","PMID":22963002},{"S-NO":353,"Exercise risk evaluation":"Exercise stress test","Method":"All patients underwent baseline exercise stress testing under continuous electrocardiographic monitoring with direct measurement of oxygen consumption to document aerobic fitness. Tests were reviewed by investigators to identify significant arrhythmias or ischemia that would prevent safe exercise training and to establish appropriate training heart rate ranges.","PMID":22851113},{"S-NO":354,"Exercise risk evaluation":"Physical examination","Method":"Prior to entry into the study, patients underwent a physical examination by a study physician. If a patient was found to have any significant medical condition that would contraindicate safe participation in the study, s\/he was excluded from participation.","PMID":22858387},{"S-NO":355,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"Resting, exercise, and recovery cardiovascular assessments were made to ensure the safety of potential participants in the exercise intervention at baseline and to measure changes in cardiovascular fitness at post-intervention (POST) assessment. Resting blood pressure was measured via auscultation with a calibrated sphygmomanometer. A maximal graded exercise test (GXT) was utilized to assess aerobic capacity and exercise tolerance at baseline and POST assessments. Each individual completed the GXT on a Monark 874E cycle ergometer under the supervision of the study medical director and exercise technician to volitional fatigue or to a symptom\/response limited end point. Cardiovascular responses (12-lead electrocardiogram, blood pressure, and heart rate) were evaluated at each stage, throughout the GXT and recovery. Pulmonary gas exchange was measured throughout the GXT to determine peak aerobic fitness (VO2 peak) utilizing a Parvo Medics’ TrueOne metabolic measurement system and exercise tolerance was quantified as total time for the GXT and cardiovascular response for given submaximal workloads.","PMID":22350739},{"S-NO":357,"Exercise risk evaluation":"Medical clearance","Method":"Medical clearance was obtained from each participant's primary care physician prior to initiating exercise. ","PMID":22888415},{"S-NO":367,"Exercise risk evaluation":"Physical examination","Method":null,"PMID":22341377},{"S-NO":371,"Exercise risk evaluation":"Medical clearance","Method":"A written statement of adequate physical health to participate was required from a physician. ","PMID":22135751},{"S-NO":375,"Exercise risk evaluation":"Medical clearance","Method":"Referral was required by a medical specialist or general practitioner (GP), who checked whether at least three of the following criteria were met: having physical  complaints, reduced physical capacity, psychological problems, increased fatigue,  sleep disturbances and problems in coping with reduced physical and psychosocial  functioning due to cancer.","PMID":21038171},{"S-NO":378,"Exercise risk evaluation":"Incremental cycle ergometry test","Method":"Study candidates underwent a sports medicine examination at the Hamburg University Institute of Sports Medicine in  order to assess the health status of eligible participants and to avoid any  potential medical risks. In order to determine the individual levels of fitness, participants completed a stepwise incremental cycle ergometry test. Subjects were  presented to the ergometry lab of the Institute for Sports and Exercise Medicine in the afternoon. After resting for 5 min (sitting on the ergometer), they were asked to start cycling on the ergometer beginning at 25 W. Every 2 min, the resistance was increased by 25 W. Subjects were asked to keep cycling until they were exhausted. VO2 and heart rate were  recorded continuously.","PMID":21577030},{"S-NO":380,"Exercise risk evaluation":"Cardiopulmonary stress test","Method":null,"PMID":21146688},{"S-NO":382,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":21616540},{"S-NO":384,"Exercise risk evaluation":"Maximal exercise test","Method":"All participants received a maximal exercise test to determine cardiorespiratory fitness (maximal oxygen consumption, or VO2 max, calculated as liters of oxygen per minute), to screen for abnormal blood pressure and electrocardiogram responses, and to aid in the generation of exercise prescriptions.","PMID":21658349},{"S-NO":391,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"All patients had a baseline symptom-limited cardiopulmonary exercise test under continuous electrocardiographic recording by a Cambridge Heart 12 ECG System Co, on a nondialysis day, according to Bruce protocol.  Expired air was collected in a facemask and analyzed on a breath-by-breath basis for quantification of oxygen consumption (VO2), expired ventilation, and expiratory exchange  ratio (VCO2\/VO2) with the use of the MedGraphics Breeze Suite CPX Ultima ergospirometer device. Peak values  were determined from an average measured during the last 60 s when respiratory exchange ratio was greater  than 1.0–1.10.  VO2peak was defined as the highest VO2  obtained, characterized by a plateau of oxygen uptake (steady state), despite further increases in work rate.","PMID":19745744},{"S-NO":393,"Exercise risk evaluation":"Submaximal bicycle ergometer test","Method":"Aerobic capacity was assessed by a submaximal bicycle ergometer test where heart rate is monitored during 5–7 min of bicycling with moderate intensity and the VO2max was   calculated according to Aastrand’s indirect method.","PMID":20100135},{"S-NO":394,"Exercise risk evaluation":"Health history questionnaire","Method":"To be eligible for participation, individuals were required to be physically able to exercise, determined by a health history questionnaire.","PMID":20351589},{"S-NO":399,"Exercise risk evaluation":"Graded maximal exercise stress test","Method":"Participants completed a physician supervised graded maximal exercise stress test, using the Bruce protocol, prior to randomization and at post-treatment. ","PMID":19728220},{"S-NO":400,"Exercise risk evaluation":"Maximal graded exercise stress test","Method":"Major complications experienced during pregnancy and labor\/delivery, demographic information, and medical history were assessed via a semistructured interview. Cardiovascular fitness was measured using a maximal graded exercise stress test on a treadmill using a Bruce  protocol. Fitness was then evaluated by time on test  and maximal METs capacity.","PMID":19616143},{"S-NO":401,"Exercise risk evaluation":"Physical examination","Method":null,"PMID":18985351},{"S-NO":402,"Exercise risk evaluation":"Medical clearance","Method":"Preliminary screening evaluations included a medical history, physical examination, routine blood and urine analyses, blood pressure, heart rate, and electrocardiogram.","PMID":18068829},{"S-NO":408,"Exercise risk evaluation":"Walking test","Method":"To measure physical fitness, we used the outdoor 2 km walking test. The test is simple and safe and it can be used for a big study group. Every patient walked 2 km as fast as possible. The polar FS2c heart rate monitor was used to measure heart rate (HR). Physical fitness was calculated by taking the time for walking the 2 km distance in minutes  and seconds, HR at the end of the distance, age in years and body mass index (BMI). The calculations of physical fitness for males and females were different. Aerobic fitness  or physical fitness in males was calculated by using  the formula 420 – (11.6×minutes + 0.2×seconds + 0.56×HR + 2.6×BMI – 0.2×age) and in females by using the  formula 304 – (8.5×minutes + 0.14×seconds + 0.32×HR + 1.1×BMI – 0.4×age).  A fitness index below 70  indicated very poor physical fitness, 70–90 poor, 90–110 moderate, 110–130 good and above 130 excellent physical fitness。","PMID":19065108},{"S-NO":410,"Exercise risk evaluation":"Graded maximal exercise stress test","Method":"Cardiovascular fitness was measured using a maximal graded exercise stress test on a treadmill. Using a Bruce protocol, the test consisted of increasing workloads of approximately three metabolic equivalents every three minutes until the subject reached volitional exhaustion or any of the American College of Sports Medicine (ACSM) indicators for stopping an exercise test. A 12-lead electrocardiogram measured heart rate and rhythm at rest, continuously during the test and for 5 min during recovery. Blood pressure was measured at rest and every 2 min during exercise and recovery.","PMID":18373127},{"S-NO":412,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"Graded treadmill exercise testing was conducted before and after treatment. Patients exercised to exhaustion or standard end points (e.g., >2 mm ST-segment depression, abnormal blood pressure response, etc.) under continuous electrocardiographic monitoring using the Duke–Wake Forest protocol in which workloads are increased at a rate of 1 METImin−1. Expired air was collected by mouthpiece for quantification of minute ventilation, oxygen consumption, and carbon dioxide production with a Beckman Metabolic Cart. Samples were collected at 20-s intervals, and peak values were determined from an average obtained during the last 60 s.","PMID":18580416},{"S-NO":413,"Exercise risk evaluation":"Physical examination;Cardiopulmonary exercise test","Method":"Before entry into the study, patients underwent a physical examination by a study physician. Blood pressure was measured by standard sphygmomanometry in sitting and standing positions. Patients were also given blood tests including routine electrolytes, pregnancy and liver function tests, blood count, and thyroid stimulating hormone (TSH). If a patient was found to have any significant medical condition that would contraindicate safe participation in this study, he\/she was excluded from participation in the study. Graded treadmill exercise testing was conducted before treatment and at the conclusion of treatment to document the patients’ fitness levels and establish an exercise training prescription for those patients subsequently randomized to exercise. Patients exercised to exhaustion or other standard end points (e.g., chest pain, decreasing blood pressure, complex premature ventricular contractions, progressive ST-segment depression) under continuous electrocardiographic monitoring using the Duke-Wake Forest protocol in which workloads are increased at a rate of 1 metabolic equivalent per minute. Expired air was collected by mouthpiece for quantification of minute ventilation, oxygen consumption (VO2), and carbon dioxide production. Samples were collected at 20-second intervals, and peak values were determined from an average obtained during the last 60 seconds.","PMID":17846259},{"S-NO":420,"Exercise risk evaluation":"Medical clearance;Graded exercise test","Method":"All women in the study were required to obtain medical clearance to exercise and  physician confirmation of depression diagnosis prior to enrollment. Participants underwent a physician-monitored graded exercise test on a  treadmill using a Balke protocol. Physicians monitoring exercise tests were blinded to participant  group assignment. A 12-lead ECG and a PhysioDyne metabolic cart were used to determine peak heart rate, peak oxygen consumption (VO2 peak), total work, time on test, and  suitability for exercise. VO2 peak served as the primary fitness marker in this study. ","PMID":18062765},{"S-NO":421,"Exercise risk evaluation":"Bruce treadmill test","Method":"To quantify the training intensity, maximal physical performance in the endurance exercise group was assessed by a modified Bruce treadmill test under continuous electrocardiogram monitoring on admission and at the end of the study. The test was started at 3 km\/h and carried out until patients reached 80% of the expected maximal heart rate, defined as 220−age. Lactate concentration in capillary blood was assessed every 3 min. Maximal oxygen uptake in ml\/kg\/min was calculated by using the maximal physical performance according to the guidelines of the American College of Sports Medicine.","PMID":17062659},{"S-NO":423,"Exercise risk evaluation":"Medical clearance","Method":"Participants were screened for their general health using an electrocardiogram (all leads), fasting blood glucose level, and blood pressure measurements, and a detailed clinical   examination.  ","PMID":17310659},{"S-NO":426,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"Maximal exercise testing was performed using the Duke-Wake Forest protocol in which graded exercise began at 3.2 kilometers per hour and 0% grade and workload was increased at a rate of 1 metabolic equivalent per minute (oxygen, 3.5 mL\/kg per minute). Expired gases were collected for the determination of peak oxygen consumption using a metabolic cart.","PMID":17980217},{"S-NO":428,"Exercise risk evaluation":"Submaximal exercise test","Method":"The endurance test was performed on a bicycle ergometer by the multistage YMCA submaximal exercise test protocol. The heart rates were measured when the subjects were seated at rest for 5 min and during the last minute of each incremental stage of exercise. Peak oxygen uptake was estimated on the basis of the heart rate increments to workloads.","PMID":16126743},{"S-NO":429,"Exercise risk evaluation":"PAR-Q","Method":null,"PMID":17134517},{"S-NO":430,"Exercise risk evaluation":"PAR-Q;Physical examination","Method":"PAR-Q;Medical examination","PMID":16883145},{"S-NO":432,"Exercise risk evaluation":"Cardiopulmonary test","Method":"Maximum volume of oxygen uptake(V02 max) was used as the measure of cardiorespiratory function and was estimated using a treadmill with heart-rate monitor interface. After warm-up, participants were taken through consecutive 3-min. stages with a progressive increase in speed and grade until they requested stopping or reached their age-predicted 85% maximal heart rate. Values were expressed in ml\/kg\/min.","PMID":16050652},{"S-NO":434,"Exercise risk evaluation":"Electrocardiogram","Method":"We conducted resting and stress electrocardiograms to ensure the volunteers' cardiovascular health.","PMID":16358106},{"S-NO":439,"Exercise risk evaluation":"Exercise bicycle test","Method":"For safety precautions, daily preexercise screening was performed. Other safety measures included on-site supervision by nurses and  wireless heart monitors worn by patients during  the training sessions. Aerobic capacity of the participants was indirectly estimated by use of a stepwise work capacity on an exercise bicycle. The first part of the test was a “steady rate” test of 8 min duration whereas the second part comprised a “watt max” test. The steady rate test started with a workload of 67 W over 8 min with the participants’ pulse rates being recorded during the f inal minute of the test. The watt max test started with a workload of 67 W, increasing by 20 W each consequent minute. The test was terminated when the participant could not or did not  wish to continue cycling. The heart rate, the workload, and collective time duration were then recorded. VO2Max was estimated using the formula VO2max =0.16＋(0.0117× maximum power output MPO).","PMID":16594459},{"S-NO":440,"Exercise risk evaluation":"Maximal graded exercise test","Method":null,"PMID":16049630},{"S-NO":441,"Exercise risk evaluation":"PAR-Q;Medical clearance","Method":null,"PMID":16304506},{"S-NO":443,"Exercise risk evaluation":"Ergospirometric test","Method":"Ergospirometric test. To evaluate aerobic capacity, the following variables were determined: maximum oxygen consumption (VO2peak), anaerobic ventilatory threshold (VO2threshold), maximum heart rate (HRpeak), and anaerobic ventilatory threshold rate.","PMID":16258639},{"S-NO":446,"Exercise risk evaluation":"PAR-Q","Method":"The individual was also given the PAR-Q to complete. If they answered ‘yes’ to  any questions on the PAR-Q they were required to have a  medical certificate from their GP, clearing them to be able to take part in the physical activity. ","PMID":15265228},{"S-NO":446,"Exercise risk evaluation":"Exercise test","Method":"Participants were given the choice of five mornings  between 06.00 hours and 07.30 hours to attend the fitness testing. The test was conducted on a grassed, flat oval prior  to the commencement and at the completion of the intervention period. Volunteers supervised the children and  trained physiologists were present to help administer the  test and explain the procedures. Participants were  required to warm up by walking on the CWW. To maxi-mize the reliability of the data, strict guidelines were  adhered to in the administration of the test. The participant’s HR was recorded with polar HR monitors every  three minutes as the intensity level increased. The predicted VO2max was extrapolated and used to compare groups’ pretest  data to post-test effects.","PMID":15265228},{"S-NO":449,"Exercise risk evaluation":"Graded treadmill test","Method":"The fitness test was a field adapted version of a graded treadmill test.  The test involved the participant beginning at the 22 metre colour-coded marker and walking around in a circular motion keeping up with a beep sound which was set at 10-second intervals.  Continuity and pace with the beep was crucial and an instructor was with the participant to ensure they followed the correct procedure.  After 3 minutes the participant's heart rate was recorded and they moved out another 2 metres.  As the participant moved out on each 2-metre stage the pace, distance and intensity increased.  The process of 3-minute intervals of exercise followed heart rate monitoring and moving further out on the wheel.  This continued until the participant reached 80% of their maximum heart rate or they felt fatigued, uncomfortable or exhausted and unable to continue.  The test is a predictive test used to predict maximal aerobic capacity.  A predicted VO2 value was obtained by extrapolating the relationship between heart rate and VO2, to age predicted maximal heart rate (HR max.).","PMID":12956024},{"S-NO":449,"Exercise risk evaluation":"PAR-Q","Method":"The Physical Activity Research Questionnaire (PAR-Q) is a seven-item questionnaire that identifies individuals who physically may not meet the demands that an exercise programme might offer. Participants answered the questionnaire prior to taking part in the study. If a participant answered 'yes' to one or more questions, they were required to have a physical examination with their doctor. A letter of approval was then required from their GP granting them approval to take part in an exercise programme.","PMID":12956024},{"S-NO":451,"Exercise risk evaluation":"Medical clearance","Method":"During screening, all participants were examined and cleared medically by an AIDS Clinical Trials Unit(ACTU) physician.","PMID":12698764},{"S-NO":451,"Exercise risk evaluation":"Graded exercise test","Method":"Aerobic fitness or peak aerobic  power (VO2 max) was measured during graded exercise testing on a motor-driven treadmill. Testing followed guidelines adapted from American College of Sports Medicine (ACSM) standards for exercise testing and was done in a controlled laboratory  setting by staff members experienced with exercise  testing in clinical populations.","PMID":12698764},{"S-NO":452,"Exercise risk evaluation":"Physical examination;Graded bicycle lactate test","Method":"Before exercise, individual performance was measured on a cycle ergometer. Participants rode at graded workloads (in steps of 50 W) for 3 minutes at each level.  At the end of each workload, heart rate was measured and arterialized blood was taken from the earlobe.  The lactic acid concentration in the blood was analyzed using YSI 2300 STAT PLUS and YSI 2710 Turntable. To ensure aerobic exercise at 2 different workload levels, for each subject the levels (in watts) that corresponded to 40% and 60% of the 4-mmol\/L lactic acid workload level were determined.","PMID":14628975},{"S-NO":455,"Exercise risk evaluation":"Walking test","Method":"Immediately before and after the study, subjects in the Light Plus Aerobics and Aerobics groups participated in a 2-km walking test that predicts the maximal oxygen uptake using a model with age, sex, walking time, BMI, and heart rate at the end of the test as variables.","PMID":12000205},{"S-NO":456,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"The physical work capacity was also determined by the measurement of VO2max and duration of exercise during a graded exercise treadmill stress test, using a modified Bruce protocol. Theoretically, maximal oxygen consumption is the oxygen amount that one can uptake maximally during exercise. In this study, oxygen consumption during the stress test was determined by analyzing the fractions of oxygen and carbon dioxide in the expired air. The recorded maximum heart rate (HRmax), blood pressure and VO2max determined the exercise prescription.","PMID":12166700},{"S-NO":457,"Exercise risk evaluation":"Modified Bruce treadmill test","Method":"Maximal physical performance was assessed  at the beginning and end of the study with a  modified Bruce treadmill test under continuous electrocardiogram monitoring. The test  was carried out until subjective exhaustion. Heart rate was continuously assessed; blood  pressure and lactate concentration in capillary blood were assessed every three minutes. Maximal oxygen uptake in ml\/kg\/min, an indicator of maximal physical performance, was calculated according to the guidelines of the American College of Sports Medicine.","PMID":11273973},{"S-NO":458,"Exercise risk evaluation":"Treadmill test.","Method":null,"PMID":11020092},{"S-NO":461,"Exercise risk evaluation":"Clinical exercise test","Method":"A 2-3-min warm-up pedaling period at low workload (30 kg × m\/min) preceded the clinical exercise test. Thereafter, a subject was asked to maintain a constant cycling speed of 60 rev.\/min. The initial work rate was 300 kg× m\/min and it was increased by 150 kg × m\/min every 3 min. The pedaling stopped after reaching the upper threshold corresponding to the submaximal level of leg work. This threshold was determined individually as the exercise intensity requiring 75-80% of the age-predicted maximal heart rate. The sum of physical work made at different work rates over the testing period was used as an index of physical work capacity.","PMID":10788675},{"S-NO":462,"Exercise risk evaluation":"Symptom-limited graded exercise treadmill test","Method":null,"PMID":10718684},{"S-NO":463,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"At baseline and at the conclusion of 4 months of treatment, participants underwent a symptom-limited graded exercise treadmill test under continuous electrocardiographic recording. A modified Balke protocol was used in which workloads were increased at a rate of 1 metabolic equivalent per minute.  Expired air was collected by mouthpiece for quantification of minute ventilation, oxygen consumption, and carbon dioxide production.  Samples were collected at 15-second intervals, and peak values were determined from an average obtained during the last 60 seconds.  Patients exercised to exhaustion or to other standard clinical end points (eg, significant chest pain, drop in blood pressure, complex premature ventricular contractions, progressive ST segment depression).","PMID":10547175},{"S-NO":467,"Exercise risk evaluation":"Symptom-limited exercise test","Method":"Before entering the program, patients underwent symptom-limited exercise testing, usually carried out by a ramp treadmill protocol. Breath-to-breath on-line gas analysis was performed with a MedGraphics CPX\/D metabolic cart, with incremental data collected every 15 seconds. The maximum rate of oxygen consumption, anaerobic threshold, and   metabolic equivalents were determined on the basis ofestablished criteria. After the outpatient cardiac rehabilitation exercise training program, each patient underwent a protocol similar to the preprogram exercise assessment.","PMID":8831359},{"S-NO":468,"Exercise risk evaluation":"Medical clearance","Method":"Medical clearance was obtained via a physician-performed physical examination that included a detailed health history, resting electrocardiogram, and neuromuscular testing.","PMID":7605184},{"S-NO":468,"Exercise risk evaluation":"Graded exercise test","Method":"Aerobic fitness was assessed via a graded exercise test. All subjects who completed an asymptomatic graded exercise test were given a prescription for involvement in aerobic exercise training; whereas subjects whose graded exercise test indicated cardiovascular abnormalities were referred to their family physician for further medical evaluation. Aerobic fitness was assessed for all subjects (ie, exercise and control) via VO2peak measures attained during a physician-monitored graded exercise test.  A Schwinn Air-Dyne cycle ergometer was used that functions on the basis of airdisplacement resistance such that the higher the revolutions per minute (RPM), the higher the work rate achieved. The   ergometer allows for use of any combination of limbs and was modified to allow for testing from a seated position in a wheelchair. Heart rates and blood pressures were monitored throughout exercise and recovery periods.  Respiratory gases were continuously sampled and analyzed every 30 seconds throughout the exercise portion of the test by means of an indirect calorimetry system using a Beckman Metabolic Cart. In an attempt to minimize early termination of   the exercise test owing to local muscular fatigue, a discontinuous, progressive protocol of 2 minutes of exercise followed by 2 minutes of rest was employed.  Similar work rate increments were employed with all subjects;  initial work rates were determined by the amount of functional muscle mass available for exercising. VO2peak was measured at the point of peak volitional fatigue or symptom limitation.","PMID":7605184},{"S-NO":469,"Exercise risk evaluation":"Medical clearance","Method":"Clients whose health status was judged to be satisfactory based on medical records, evaluations of registered nurses, and a physical examination by a physician were given the opportunity to volunteer to participate in the study.","PMID":7675585},{"S-NO":469,"Exercise risk evaluation":"Kasch step test","Method":"Kasch Step Test. This procedure involves having the subject step up and down on a bench 30.48 cm high for 3 min. at a rate of 24 times per min. Cadence, i.e., \"step up, step down,\" was prerecorded on a cassette tape-player and played for the participants so that they could step at the proper rate, Immediately following the stepping, subject's pulse was taken from the subject's wrist for 1 min. by the investigator. This was recorded and used to judge subject's fitness. Subjects could stop the test at any point if they felt uncomfortable. At the point they stopped, the pulse was recorded for 1 min.","PMID":7675585},{"S-NO":471,"Exercise risk evaluation":"Exercise bicycle test","Method":"Aerobic fitness was characterized by the maximum oxygen uptake which was predicted from the heart rate attained after 6 min exercising on a bicycle ergometer.","PMID":1433121},{"S-NO":473,"Exercise risk evaluation":"Submaximal bicycle ergometer test","Method":"Physical condition was assessed by a submaximal bicycle ergometer test, and the VO2max was calculated according to Astrand’s indirect method. ","PMID":2667882},{"S-NO":474,"Exercise risk evaluation":"Cooper 12-min walk test","Method":"Cooper 12-min walk test. The Cooper test asked subjects to walk as far as possible on an indoor track in 12 min. Total  distance has been found to be highly related to maximal oxygen consumption, a measure of aerobic functioning.","PMID":1930766},{"S-NO":475,"Exercise risk evaluation":"Medical clearance;Symptom-limited exercise test","Method":"Prior to entering the study, patients were examined by a cardiologist and had a resting electrocardiogram (ECG) recorded. All had a symptom-limited graded exercise treadmill stress test to determine if they exhibited any medical condition which would contraindicate participation in an exercise training(ET) program. All exercise tests were terminated when the patients indicated they could not continue. ","PMID":3317091},{"S-NO":477,"Exercise risk evaluation":"Ergometer bicycle test","Method":"Physical condition was assessed by ergometer bicycle testing,  measuring maximum oxygen uptake according to Aastrand's indirect  method.","PMID":3926074},{"S-NO":478,"Exercise risk evaluation":"Walk-run test","Method":"The subjects in all of the conditions participated in a 12-min walk-run test of aerobic capacity. In this test, subjects were asked to run (or walk if it became necessary) as far as possible during a 12-min period.  The test was conducted on a 1\/8 mile (201 m) indoor track with a synthetic surface, and the distance a subject covered was the measure of her aerobic capacity.","PMID":6737208},{"S-NO":480,"Exercise risk evaluation":"Cardiopulmonary exercise test","Method":"The symptom-limited CPET on a treadmill according to a ramp protocol and ESC guidelines was performed using a Schiller MTM-1500 med. Oxygen consumption was measured continuously using breath-by-breath analysis. Obtained peak VO2 value was presented per kilogram of body mass per minute (mL\/kg\/min). Maximal exercise was defined as the respiratory exchange ratio≥1 or maximum fatigue according to the Borg scale.","PMID":35037037},{"S-NO":484,"Exercise risk evaluation":"Medical clearance","Method":"All residents were assessed to identify the aspects of their medical history, psychological and physical abilities that would need to be considered in the delivery of moderately intense group exercise activities and screened for absolute contraindications to exercise such as recent operations and severe breathlessness at rest according to New York Heart Association Class IV. This information was drawn from observations, resident's report, care home records or care home staff. Residents who were unable to maintain a seated position while moving their limbs were excluded, and the levels of exercise activities matched to both aerobic\/strength capacity and postural stability. Review of resident's health and ability to participate in the exercise and physical activity programme were undertaken by the physiotherapist and care home staff on an ongoing basis in order to ensure safety and progression where changes in functional status were occurring.","PMID":23632142}]